### 할로윈 투자 전략
1. 11월 첫날에 매수 -> 4월 마지막날에 매도
2. 11월 첫날 시가로 매수
3. 4월 마지막날에 종가로 매도
4. 수익률 계산 -> 매도가 / 매수가
5. 누적수익률 계산

In [3]:
from datetime import datetime
import pandas as pd
from dateutil.relativedelta import relativedelta

In [4]:
# 데이터 로드
df = pd.read_csv('../../csv/AMZN.csv', index_col = 'Date')

In [5]:
df.head(1)

              Open  High       Low     Close  Adj Close    Volume
Date
1997-05-15  2.4375   2.5  1.927083  1.958333   1.958333  72156000

In [6]:
# 인덱스를 시계열 데이터로 변경
df.index = pd.to_datetime(df.index, format = '%Y-%m-%d')

In [7]:
# 2000년 11월 데이터를 출력하려면? 
df.loc['2000-11', ].iloc[0, 0]

35.8125

In [8]:
df.loc['2000-11', ].head(1)['Open']

Date
2000-11-01    35.8125
Name: Open, dtype: float64

In [9]:
df.loc['2000-11', 'Open'][0]

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\1122638607.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc['2000-11', 'Open'][0]

35.8125

In [10]:
df.loc['2001-04', 'Close'][-1]

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2496373566.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc['2001-04', 'Close'][-1]

15.78

In [11]:
# 2000년부터 2010년까지 할로윈 투자 데이터를 추출

# 비어 있는 데이터프레임 생성
price_df = pd.DataFrame()

for i in range(2000, 2010, 1): 
    # 매수하는 달을 문자열로 변수 생성
    buy_mon = f'{i}-11'         # 2000-11, 2001-11, 2002-11, ...
    sell_mon = str(i+1)+'-04'   # 2001-04, 2002-04, 2003-04, ...
    # buy_mon에 조건식이 참인 데이터에서 첫날의 데이터만 추출
    buy = df.loc[buy_mon, ].head(1)
    sell = df.loc[sell_mon, ].tail(1)
    # price_df와 buy를 결합 (단순 행 결합 -> 유니온 결합)
    # concat({결합한 데이터프레임들을 리스트 형태로}, axis={0|1}, ignore_index={bool})
    price_df = pd.concat([price_df, buy, sell], axis=0)

In [12]:
price_df = price_df[['Open', 'Close']]

In [13]:
# 수익률 칼럼을 생성하여 1을 대입
price_df['rtn'] = 1

In [14]:
# 위치의 값이 홀수인 경우 수익률 계산
for i in range(len(price_df)): 
    # 홀수인 조건
    if i % 2 == 1: 
        rtn = price_df.iloc[i, ]['Close'] / price_df.iloc[i-1, ]['Open']
        price_df.iloc[i, 2] = rtn

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\4212222748.py:6: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  price_df.iloc[i, 2] = rtn

In [15]:
price_df

                  Open       Close       rtn
Date
2000-11-01   35.812500   37.375000  1.000000
2001-04-30   15.630000   15.780000  0.440628
2001-11-01    7.080000    6.950000  1.000000
2002-04-30   16.129999   16.690001  2.357345
2002-11-01   19.219999   19.799999  1.000000
2003-04-30   28.600000   28.690001  1.492716
2003-11-03   54.799999   56.740002  1.000000
2004-04-30   46.060001   43.599998  0.795620
2004-11-01   34.220001   35.099998  1.000000
2005-04-29   32.860001   32.360001  0.945646
2005-11-01   39.970001   40.369999  1.000000
2006-04-28   35.770000   35.209999  0.880911
2006-11-01   38.130001   37.560001  1.000000
2007-04-30   61.910000   61.330002  1.608445
2007-11-01   87.750000   87.650002  1.000000
2008-04-30   80.900002   78.629997  0.896068
2008-11-03   56.349998   55.770000  1.000000
2009-04-30   80.930000   80.519997  1.428926
2009-11-02  118.660004  118.839996  1.000000
2010-04-30  141.399994  137.100006  1.155402

In [16]:
price_df['rtn2'] = 1

In [17]:
for i in range(1, len(price_df), 2): 
    rtn = price_df.iloc[i, ]['Close'] / price_df.iloc[i-1, ]['Open']
    price_df.iloc[i, 3] = rtn

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\508433103.py:3: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  price_df.iloc[i, 3] = rtn

In [18]:
price_df

                  Open       Close       rtn      rtn2
Date
2000-11-01   35.812500   37.375000  1.000000  1.000000
2001-04-30   15.630000   15.780000  0.440628  0.440628
2001-11-01    7.080000    6.950000  1.000000  1.000000
2002-04-30   16.129999   16.690001  2.357345  2.357345
2002-11-01   19.219999   19.799999  1.000000  1.000000
2003-04-30   28.600000   28.690001  1.492716  1.492716
2003-11-03   54.799999   56.740002  1.000000  1.000000
2004-04-30   46.060001   43.599998  0.795620  0.795620
2004-11-01   34.220001   35.099998  1.000000  1.000000
2005-04-29   32.860001   32.360001  0.945646  0.945646
2005-11-01   39.970001   40.369999  1.000000  1.000000
2006-04-28   35.770000   35.209999  0.880911  0.880911
2006-11-01   38.130001   37.560001  1.000000  1.000000
2007-04-30   61.910000   61.330002  1.608445  1.608445
2007-11-01   87.750000   87.650002  1.000000  1.000000
2008-04-30   80.900002   78.629997  0.896068  0.896068
2008-11-03   56.349998   55.770000  1.000000  1.000000
2009-04-30   80.930000   80.519997  1.428926  1.428926
2009-11-02  118.660004  118.839996  1.000000  1.000000
2010-04-30  141.399994  137.100006  1.155402  1.155402

In [19]:
price_df['rtn3'] = 1 # 수익률 계산할 때 1 채우고 시작!! 누적곱이 쉬워진다!!

In [20]:
# 데이터 중 4월의 데이터만 추출
price_df.index.month == 4

array([False,  True, False,  True, False,  True, False,  True, False,
        True, False,  True, False,  True, False,  True, False,  True,
       False,  True])

In [21]:
flag = price_df.index.month == 4

In [22]:
price_df.loc[flag, ]

                  Open       Close       rtn      rtn2  rtn3
Date
2001-04-30   15.630000   15.780000  0.440628  0.440628     1
2002-04-30   16.129999   16.690001  2.357345  2.357345     1
2003-04-30   28.600000   28.690001  1.492716  1.492716     1
2004-04-30   46.060001   43.599998  0.795620  0.795620     1
2005-04-29   32.860001   32.360001  0.945646  0.945646     1
2006-04-28   35.770000   35.209999  0.880911  0.880911     1
2007-04-30   61.910000   61.330002  1.608445  1.608445     1
2008-04-30   80.900002   78.629997  0.896068  0.896068     1
2009-04-30   80.930000   80.519997  1.428926  1.428926     1
2010-04-30  141.399994  137.100006  1.155402  1.155402     1

In [23]:
for i in price_df.index: 
    # i가 의미하는 바는? 인덱스 데이터
    if i.month == 4: 
        rtn = price_df.loc[i, 'Close'] / price_df.shift().loc[i, 'Open']
        price_df.loc[i, 'rtn3'] = rtn

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\4011191873.py:5: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.4406282722513089' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  price_df.loc[i, 'rtn3'] = rtn

In [24]:
price_df

                  Open       Close       rtn      rtn2      rtn3
Date
2000-11-01   35.812500   37.375000  1.000000  1.000000  1.000000
2001-04-30   15.630000   15.780000  0.440628  0.440628  0.440628
2001-11-01    7.080000    6.950000  1.000000  1.000000  1.000000
2002-04-30   16.129999   16.690001  2.357345  2.357345  2.357345
2002-11-01   19.219999   19.799999  1.000000  1.000000  1.000000
2003-04-30   28.600000   28.690001  1.492716  1.492716  1.492716
2003-11-03   54.799999   56.740002  1.000000  1.000000  1.000000
2004-04-30   46.060001   43.599998  0.795620  0.795620  0.795620
2004-11-01   34.220001   35.099998  1.000000  1.000000  1.000000
2005-04-29   32.860001   32.360001  0.945646  0.945646  0.945646
2005-11-01   39.970001   40.369999  1.000000  1.000000  1.000000
2006-04-28   35.770000   35.209999  0.880911  0.880911  0.880911
2006-11-01   38.130001   37.560001  1.000000  1.000000  1.000000
2007-04-30   61.910000   61.330002  1.608445  1.608445  1.608445
2007-11-01   87.750000   87.650002  1.000000  1.000000  1.000000
2008-04-30   80.900002   78.629997  0.896068  0.896068  0.896068
2008-11-03   56.349998   55.770000  1.000000  1.000000  1.000000
2009-04-30   80.930000   80.519997  1.428926  1.428926  1.428926
2009-11-02  118.660004  118.839996  1.000000  1.000000  1.000000
2010-04-30  141.399994  137.100006  1.155402  1.155402  1.155402

In [25]:
price_df['rtn'].cumprod()

Date
2000-11-01    1.000000
2001-04-30    0.440628
2001-11-01    0.440628
2002-04-30    1.038713
2002-11-01    1.038713
2003-04-30    1.550503
2003-11-03    1.550503
2004-04-30    1.233612
2004-11-01    1.233612
2005-04-29    1.166560
2005-11-01    1.166560
2006-04-28    1.027635
2006-11-01    1.027635
2007-04-30    1.652894
2007-11-01    1.652894
2008-04-30    1.481106
2008-11-03    1.481106
2009-04-30    2.116392
2009-11-02    2.116392
2010-04-30    2.445283
Name: rtn, dtype: float64

In [39]:
start = datetime(year=2000, month=11, day=1)
start

datetime.datetime(2000, 11, 1, 0, 0)

In [40]:
# 시작일로부터 5개월 뒤
end = start + relativedelta(months=5)

In [41]:
start + relativedelta(days=10)

datetime.datetime(2000, 11, 11, 0, 0)

In [42]:
start = start.strftime('%Y-%m')
start

'2000-11'

In [43]:
end = end.strftime('%Y-%m')
end

'2001-04'

### 할로윈 투자 전략을 함수화
- 매개변수 4개: 데이터프레임, 시작연도, 종료연도, 시작월
    - 시작연도 기본값은 2000
    - 종료연도 기본값은 2010
    - 시작월 기본값은 11
- 칼럼에 Date가 존재하는가? 
    - 존재한다면 Date를 인덱스로 변경
- 인덱스를 시계열 데이터로 변환

In [46]:
# 할로윈 투자 전략을 함수화
def six_month(_df, 
              _start = 2000, 
              _end = datetime.now().year, 
              _month = 11): 
    df = _df.copy()
    if 'Date' in df.columns: 
        df.set_index('Date', inplace=True)
    
    df.index = pd.to_datetime(df.index, format='%Y-%m-%d')
    df = df[['Open', 'Close']]

    # 비어 있는 데이터프레임 생성
    result = pd.DataFrame() 

    for i in range(_start, _end): 
        start = datetime(year=i, month=_month, day=1)
        end = start + relativedelta(months=5)

        buy_mon = start.strftime('%Y-%m')
        sell_mon = end.strftime('%Y-%m')

        try: 
            buy = df.loc[buy_mon, ].head(1)
            sell = df.loc[sell_mon, ].tail(1)

            result = pd.concat([result, buy, sell], axis=0)
        except: 
            break
    
    # 수익률 계산
    result['rtn'] = 1
    for i in range(1, len(result), 2): 
        rtn = result.iloc[i, ]['Close'] / result.iloc[i-1, ]['Open']
    result.iloc[i, 2] = rtn

    # 누적수익률 계산
    result['acc_rtn'] = result['rtn'].cumprod()

    # 총누적수익률을 변수에 저장
    acc_rtn = result.iloc[-1]['acc_rtn']

    return result, acc_rtn

In [45]:
df = pd.read_csv('../../csv/AMZN.csv')

In [47]:
six_month(df)

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.1866241988678363' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn

(                   Open        Close       rtn   acc_rtn
 Date
 2000-11-01    35.812500    37.375000  1.000000  1.000000
 2001-04-30    15.630000    15.780000  1.000000  1.000000
 2001-11-01     7.080000     6.950000  1.000000  1.000000
 2002-04-30    16.129999    16.690001  1.000000  1.000000
 2002-11-01    19.219999    19.799999  1.000000  1.000000
 2003-04-30    28.600000    28.690001  1.000000  1.000000
 2003-11-03    54.799999    56.740002  1.000000  1.000000
 2004-04-30    46.060001    43.599998  1.000000  1.000000
 2004-11-01    34.220001    35.099998  1.000000  1.000000
 2005-04-29    32.860001    32.360001  1.000000  1.000000
 2005-11-01    39.970001    40.369999  1.000000  1.000000
 2006-04-28    35.770000    35.209999  1.000000  1.000000
 2006-11-01    38.130001    37.560001  1.000000  1.000000
 2007-04-30    61.910000    61.330002  1.000000  1.000000
 2007-11-01    87.750000    87.650002  1.000000  1.000000
 2008-04-30    80.900002    78.629997  1.000000  1.000000
 2008-11-03    56.349998    55.770000  1.000000  1.000000
 2009-04-30    80.930000    80.519997  1.000000  1.000000
 2009-11-02   118.660004   118.839996  1.000000  1.000000
 2010-04-30   141.399994   137.100006  1.000000  1.000000
 2010-11-01   164.449997   162.580002  1.000000  1.000000
 2011-04-29   194.380005   195.809998  1.000000  1.000000
 2011-11-01   208.110001   212.100006  1.000000  1.000000
 2012-04-30   223.949997   231.899994  1.000000  1.000000
 2012-11-01   234.229996   232.139999  1.000000  1.000000
 2013-04-30   249.369995   253.809998  1.000000  1.000000
 2013-11-01   365.630005   359.000000  1.000000  1.000000
 2014-04-30   298.100006   304.130005  1.000000  1.000000
 2014-11-03   306.239990   305.720001  1.000000  1.000000
 2015-04-30   427.109985   421.779999  1.000000  1.000000
 2015-11-02   627.130005   628.349976  1.000000  1.000000
 2016-04-29   666.000000   659.590027  1.000000  1.000000
 2016-11-01   799.000000   785.409973  1.000000  1.000000
 2017-04-28   948.830017   924.989990  1.000000  1.000000
 2017-11-01  1105.400024  1103.680054  1.000000  1.000000
 2018-04-30  1582.500000  1566.130005  1.000000  1.000000
 2018-11-01  1623.530029  1665.530029  1.000000  1.000000
 2019-04-30  1930.099976  1926.520020  1.186624  1.186624,
 1.1866241988678363)

In [53]:
# 야후 파이낸스 라이브러리 설치
!pip install yfinance

'pip'��(��) ���� �Ǵ� �ܺ� ����, ������ �� �ִ� ���α׷�, �Ǵ�
��ġ ������ �ƴմϴ�.

In [54]:
import yfinance as yf

In [55]:
aapl = yf.download('AAPL', start='2020-01-01')

[*********************100%%**********************]  1 of 1 completed

In [56]:
aapl.head()

                 Open       High        Low      Close  Adj Close     Volume
Date
2020-01-02  74.059998  75.150002  73.797501  75.087502  73.059425  135480400
2020-01-03  74.287498  75.144997  74.125000  74.357498  72.349144  146322800
2020-01-06  73.447502  74.989998  73.187500  74.949997  72.925636  118387200
2020-01-07  74.959999  75.224998  74.370003  74.597504  72.582664  108872000
2020-01-08  74.290001  76.110001  74.290001  75.797501  73.750229  132079200

In [57]:
sdi = yf.download('006400.KS', start='2015-01-01')

[*********************100%%**********************]  1 of 1 completed

In [58]:
sdi.head()

                Open      High       Low     Close      Adj Close  Volume
Date
2015-01-02  115500.0  118500.0  115500.0  117000.0  112447.515625  129817
2015-01-05  116500.0  117500.0  114500.0  115000.0  110525.359375  218029
2015-01-06  112000.0  113000.0  110000.0  111000.0  106680.984375  283326
2015-01-07  109500.0  112000.0  109000.0  110500.0  106200.437500  170777
2015-01-08  111500.0  115000.0  111000.0  114000.0  109564.250000  192137

In [59]:
six_month(aapl, _start=2020)

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0941448972939265' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn

(                  Open       Close       rtn   acc_rtn
 Date
 2020-11-02  109.110001  108.769997  1.000000  1.000000
 2021-04-30  131.779999  131.460007  1.000000  1.000000
 2021-11-01  148.990005  148.960007  1.000000  1.000000
 2022-04-29  161.839996  157.649994  1.000000  1.000000
 2022-11-01  155.080002  150.649994  1.000000  1.000000
 2023-04-28  168.490005  169.679993  1.094145  1.094145,
 1.0941448972939265)

In [61]:
# 1월부터 12월까지 6개월 유지 투자 전략
for i in range(1, 13): 
    df, acc_rtn = six_month(aapl, _start=2020, _month=i)
    print(f'{i}월에 투자 시작 시 수익률: {round(acc_rtn, 2)}')

1월에 투자 시작 시 수익률: 1.49
2월에 투자 시작 시 수익률: 1.36
3월에 투자 시작 시 수익률: 1.28
4월에 투자 시작 시 수익률: 1.04
5월에 투자 시작 시 수익률: 1.01
6월에 투자 시작 시 수익률: 1.07
7월에 투자 시작 시 수익률: 0.99
8월에 투자 시작 시 수익률: 0.94
9월에 투자 시작 시 수익률: 0.96
10월에 투자 시작 시 수익률: 1.19
11월에 투자 시작 시 수익률: 1.09
12월에 투자 시작 시 수익률: 1.2

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.4888701492030363' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.3645203534247963' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.2795068635451914' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0422475330912846' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.008802017390765' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0689364108631245' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.9935493858609027' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.9396656580449794' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '0.9560398881757635' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.193111829' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.0941448972939265' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn
C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_7764\2811435403.py:35: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '1.195938141627624' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  result.iloc[i, 2] = rtn